Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "crc.h"
#include "dcmi.h"
#include "dma.h"
#include "fatfs.h"
#include "i2c.h"
#include "ltdc.h"
#include "rtc.h"
#include "sdmmc.h"
#include "spi.h"
#include "tim.h"
#include "usart.h"
#include "usb_host.h"
#include "gpio.h"
#include "fmc.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_sdram.h"
//#include "ov9655.h"
#include "ar0135.h"
#include "rk043fn48h.h"
#include "fonts.h"
//#include "font24.c"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PIX_H 960
#define PIX_W 1280

typedef struct 
{
    uint8_t r;
    uint8_t g;
    uint8_t b;
}RGB_data_t;

uint8_t ppm_header[] = {'P','5','\n','1','2','8','0',' ','1','0','2','4','\n','2','5','5','\n'};

uint8_t CAMERA_Init(uint32_t );
static void LTDC_Init(uint32_t, uint16_t, uint16_t, uint16_t, uint16_t);
void LCD_GPIO_Init(LTDC_HandleTypeDef *, void *);
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
extern uint8_t _fb_base_lr[240][320];
extern uint8_t _fb_base_hr[PIX_H][PIX_W];
extern RGB_data_t _fb_base_ppm[PIX_H][PIX_W];
FIL fp;
//static uint8_t _fb_base_ppm[PIX_W*3];

typedef enum
{
CAMERA_OK = 0x00,
CAMERA_ERROR = 0x01,
CAMERA_TIMEOUT = 0x02,
CAMERA_NOT_DETECTED = 0x03,
CAMERA_NOT_SUPPORTED = 0x04
} Camera_StatusTypeDef;
typedef struct
{
uint32_t TextColor;
uint32_t BackColor;
sFONT *pFont;
}LCD_DrawPropTypeDef;
typedef struct
{
int16_t X;
int16_t Y;
}Point, * pPoint;
static LCD_DrawPropTypeDef DrawProp[2];
LTDC_HandleTypeDef hltdc;
LTDC_LayerCfgTypeDef
layer_cfg;
static RCC_PeriphCLKInitTypeDef periph_clk_init_struct;
CAMERA_DrvTypeDef *camera_driv;
/* Camera module I2C HW address */
static uint32_t CameraHwAddress;
/* Image size */
uint32_t Im_size = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void MX_USB_HOST_Process(void);

/* USER CODE BEGIN PFP */
uint8_t img_bayer2rgb (uint32_t index);
uint8_t img_file_append (uint8_t * p_data, uint32_t len);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_ADC3_Init();
  MX_CRC_Init();
  MX_DCMI_Init();
  MX_FMC_Init();
//  MX_I2C1_Init();
  MX_I2C3_Init();
//  MX_LTDC_Init();
  MX_RTC_Init();
  MX_SDMMC1_SD_Init();
  MX_SPI2_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_TIM5_Init();
  MX_TIM8_Init();
  MX_TIM12_Init();
  MX_USART1_UART_Init();
  MX_USART6_UART_Init();
  MX_USB_HOST_Init();
  MX_FATFS_Init();
  /* USER CODE BEGIN 2 */
  HAL_UART_MspInit (&huart1);
//  HAL_DCMI_MspInit (&hdcmi);
//  HAL_I2C_MspInit (&hi2c1);
  printf("Hello world\n");
  printf("Macro : 0x%x, LR : 0x%x, HR : 0x%x\n",FRAME_BUFFER, _fb_base_lr, _fb_base_hr);
//  uint8_t i2c_addr = 00;
//  i2c_addr = cambus_scan ();  
//  printf("First I2C device found : 0x%x\n",i2c_addr);

  
  //  LTDC_Init((uint32_t)_fb_base_lr, 0, 0, 320, 240);
//  LTDC_Init((uint32_t)_fb_base_lr, 80, 16, 400, 256);
  BSP_SDRAM_Init();
//  HAL_GPIO_TogglePin (ARDUINO_D2_GPIO_Port, ARDUINO_D2_Pin);
  Im_size = (1280*960)/4;
  memset (_fb_base_hr, 0, Im_size);
  CAMERA_Init(CAMERA_R320x240);
  HAL_Delay(100);
  HAL_GPIO_WritePin (ARDUINO_D7_GPIO_Port, ARDUINO_D7_Pin, 1);
  HAL_Delay (1);
  HAL_GPIO_WritePin (ARDUINO_D7_GPIO_Port, ARDUINO_D7_Pin, 0);
  HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, _fb_base_hr, Im_size);
  HAL_Delay(1000);
//  CAMERA_Init(CAMERA_RAW);
//  HAL_Delay(100);
//  Im_size = 1336400;
//  HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)_fb_base_hr, Im_size);
//  while(hdcmi.DMA_Handle->Instance->NDTR);
//  while(hdcmi.DMA_Handle->State != HAL_DMA_STATE_READY);
//  while(hdcmi.State != HAL_DCMI_STATE_READY);
//  printf("DCMI : XCount %d XSize %d\n", hdcmi.XferCount, hdcmi.XferSize);
  printf("DMA : Src 0x%x Dst0 0x%x Dst1 0x%x Len %d, Im_size %d\n", hdcmi.DMA_Handle->Instance->PAR
      , hdcmi.DMA_Handle->Instance->M0AR, hdcmi.DMA_Handle->Instance->M1AR
      , hdcmi.DMA_Handle->Instance->NDTR, Im_size);
//  printf("DCMI : state %d, Error %d\n",hdcmi.State, hdcmi.ErrorCode);
//  printf("DMA : state %d, Error %d\n",hdcmi.DMA_Handle->State, hdcmi.DMA_Handle->ErrorCode);
//  HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS, (uint32_t)_fb_base_lr, Im_size);

  uint32_t i, j;  
  for(i = 0; i < PIX_H; i++)
  {
      img_bayer2rgb (i);
  }
  printf("Size : PPM array %d, Bayer Array : %d\n", sizeof(_fb_base_ppm),
           sizeof(_fb_base_hr));
  
  
  if(BSP_SD_IsDetected ())
  {
      printf("SD Card detected\n");
      uint32_t status = 0;
      status = SD_initialize (0);
      if(status  == RES_OK)
      {
          printf("SD Card ready\n");
          HAL_Delay (100);
          status = f_mount (&SDFatFS, (const TCHAR*)SDPath, 1);
          if(status == FR_OK)
          {
              printf("Mount successful\n");
              printf("SD Type %d Speed %d clk_div %d\n", hsd1.SdCard.CardType, hsd1.SdCard.Class, hsd1.Init.ClockDiv);
              status = f_open (&fp, "RGB_Array_1.ppm", FA_CREATE_ALWAYS | FA_WRITE);
              if(status == FR_OK)
              {
                  uint8_t byteswritten;
                  printf("File open\n");
//                  HAL_Delay (10);
//                  printf("Frame buff pointer : 0x%x\n", _fb_base_hr);
//                  status = f_write (&fp,ppm_header, sizeof(ppm_header), &byteswritten);
//                  HAL_Delay (10);
                  status = f_write (&fp,(void *)_fb_base_ppm, sizeof(_fb_base_ppm), &byteswritten);
                  if(status == FR_OK)
                  {
                      printf("File write done\n");
                      status = f_close (&fp);
                      if(status == FR_OK)
                      {
                          printf("Safe to remove SD Card\n");
                      }
                      else{printf("Failed while appending : %d\n", status);}
                  }
                  else{printf("File write failed : %d\n", status);}
              }
              else {printf("File open failed : %d\n",status);}
          }
          else {printf("Mount Failed : %d\n", status);}
      }
      else {printf("SD Card not ready : %d\n", hsd1.State);}
  }
  else{printf("SD Card not present\n");}
  //HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS , (uint32_t)FRAME_BUFFER, Im_size);

  printf("\nBayer\n");
  for(uint16_t i = 950; i < 960; i++)
  {
      for(uint32_t j=1275; j<1280;j++) printf("%d ", _fb_base_hr[i][j]);
      printf("\n");
  }

  printf("\nRGB\n");
  for(i = 950; i < 960; i++)
  {
      for(j=1275; j<1280; j++)
      {
        printf("%d ", _fb_base_ppm[i][j].r);
        printf("%d ", _fb_base_ppm[i][j].g);
        printf("%d ", _fb_base_ppm[i][j].b);
        printf("   ");
      }
      printf("\n");
  }
  printf("DCMI : state %d, Error %d\n",hdcmi.State, hdcmi.ErrorCode);
  printf("DMA : state %d, Error %d\n",hdcmi.DMA_Handle->State, hdcmi.DMA_Handle->ErrorCode);

  
  /* USER CODE END 2 */

