Appiko/stm32h7x/F7_discovery_cam_trial/Src/main.c
}

uint8_t img_bayer2rgb (uint32_t index)
{
    //set last byte to '\n'
    //GBRG bayer format
    //if index = 0 || 479 (first and last row)
    if (index == 0 || index == (PIX_H-1))
    {
        printf("Here : %d\n",index);
        //whole row zero
        memset (&_fb_base_ppm[index][0], 0, PIX_W*3);
    }
    //check if index is odd : BG
    else if (index % 2 != 0)
    {
        //run for start from blue
        for(uint32_t raw_i = 0; raw_i < PIX_W; raw_i++)
        {
            //0th byte || (PIX_W - 1) byte 
            if (raw_i == 0 || raw_i == (PIX_W - 1))
            {
                //all zero
                _fb_base_ppm[index][raw_i].r = 0;
                _fb_base_ppm[index][raw_i].g = 0;
                _fb_base_ppm[index][raw_i].b = 0;
            }
            //check if odd byte
            else if (raw_i % 2 != 0)
            {
                //red = vertical avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index - 1][raw_i] +
                    _fb_base_hr[index + 1][raw_i])/2;
                //green = reading
                _fb_base_ppm[index][raw_i].g = _fb_base_hr[index][raw_i];
                //blue = horizontal avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index][raw_i - 1] 
                    + _fb_base_hr[index][raw_i + 1])/2;
            }
            //if even 
            else
            {
                //red = diagonal avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/4;
                //green = vertical and horizontal avg
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i - 1]
                    + _fb_base_hr[index][raw_i + 1]
                    + _fb_base_hr[index - 1][raw_i]
                    + _fb_base_hr[index + 1][raw_i])/4;
                //blue = reading
                _fb_base_ppm[index][raw_i].b = _fb_base_hr[index][raw_i];
            }
        }
    
    }
    //else index is even : GR
    else
    {
        //run for start from green
        for(uint32_t raw_i = 0; raw_i < PIX_W; raw_i++)
        {
            //0th byte || (PIX_W - 1)th byte:
            if (raw_i == 0 || raw_i == (PIX_W - 1))
            {
                //all zeros
                _fb_base_ppm[index][raw_i].r = 0;
                _fb_base_ppm[index][raw_i].g = 0;
                _fb_base_ppm[index][raw_i].b = 0;
            }
            //check if odd byte
            else if(raw_i%2 != 0)
            {
                //red = reading
                _fb_base_ppm[index][raw_i].r = _fb_base_hr[index][raw_i];
                //green = horizontal and vertical avg
                _fb_base_ppm[index][raw_i].g = (_fb_base_hr[index][raw_i - 1]
                    + _fb_base_hr[index][raw_i + 1]
                    + _fb_base_hr[index - 1][raw_i]
                    + _fb_base_hr[index + 1][raw_i])/4;
                //blue = diagonal avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index - 1][raw_i - 1] 
                    + _fb_base_hr[index - 1][raw_i + 1]
                    + _fb_base_hr[index + 1][raw_i - 1]
                    + _fb_base_hr[index + 1][raw_i + 1])/4;
            }
            //if even
            else
            {
                //red = horizontal avg
                _fb_base_ppm[index][raw_i].r = (_fb_base_hr[index][raw_i - 1] 
                    + _fb_base_hr[index][raw_i + 1])/2;
                //green = reading
                _fb_base_ppm[index][raw_i].g = _fb_base_hr[index][raw_i];
                //blue = vertical avg
                _fb_base_ppm[index][raw_i].b = (_fb_base_hr[index][raw_i - 1] 
                    + _fb_base_hr[index][raw_i + 1])/2;
            }
        }
    }
    
    
    //append file
//    uint8_t status;
//     status = img_file_append (_fb_base_ppm, sizeof(_fb_base_ppm));
//     printf("%d : %d\n", index, status);
//     return status;
    return 0;
            
}

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
    printf("!!...Error...!!\n");

    while(1);
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{ 
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
